TBL_Spalart/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.01;

vertices
(
// bump
    (  0       7.618839437   -0.132987337 )  //0
    ( 20.32    7.618839437   -0.132987337 )  //1
    ( 20.32   81.267620662   -1.418531595 )  //2
    (  0      81.267620662   -1.418531595 )  //3
    (  0       7.618839437    0.132987337 )  //4
    ( 20.32    7.618839437    0.132987337 )  //5
    ( 20.32   81.267620662    1.418531595 )  //6
    (  0      81.267620662    1.418531595 )  //7
// pre bump
    (-200      7.618839437   -0.132987337 )  //8
    (-200     81.267620662   -1.418531595 )  //9
    (-200      7.618839437    0.132987337 )  //10
    (-200     81.267620662    1.418531595 )  //11
// post bump
    ( 400      7.618839437   -0.132987337 )  //12
    ( 400     81.267620662   -1.418531595 )  //13
    ( 400      7.618839437    0.132987337 )  //14
    ( 400     81.267620662    1.418531595 )  //15

);

blocks
(
    hex ( 0  1  2  3  4  5  6  7) ( 100 73  1) simpleGrading (  1      800 1)
    hex ( 8  0  3  9 10  4  7 11) ( 200 73  1) simpleGrading (  0.0625 800 1)
    hex ( 1 12 13  2  5 14 15  6) ( 400 73  1) simpleGrading ( 16      800 1)
);

edges
(
// include bump arcs 
  
   arc 0 1 (10.16  9.523549296  -0.166234171)
   arc 4 5 (10.16  9.523549296   0.166234171)

);

boundary
(
    my-velocity-inlet
    {
        type patch;
        faces
        (
	   (10 11 9 8)
        );
    }

    my-pressure-outlet
    {
        type patch;
        faces
        (
           (14 12 13 15)
        );
    }

    my-wall
    {
        type wall;
        faces
        (
           (8 0 4 10 )
           (4 0 1 5  )
           (5 1 12 14)
        );
    }


    wedgeplanesBack
    {
        type wedge;
        neighbourPatch  wedgeplanesFront;
        rotationAxis            (1 0 0);
        rotationCentre          (0 0 0);
        matchTolerance          1.0e-6;
        faces
        (
           (8 9 3 0  )
           (0 3 2 1  )
           (2 13 12 1)
        );
    }
    
    wedgeplanesFront
    {
        type wedge;
        neighbourPatch  wedgeplanesBack;
        rotationAxis            (1 0 0);
        rotationCentre          (0 0 0);
        matchTolerance          1.0e-6;
        faces
        (
           (10 4 7 11)
           (4 5 6 7  )
           (5 14 15 6)
        );
    }

    freeSurf
    {   
        type symmetryPlane;
        faces
        (
            (11 7 3 9 )
            (7 6 2 3  )
            (6 15 13 2)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
