TBL_Spalart/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    my-velocity-inlet
    {
        type            patch;
        nFaces          73;
        startFace       101427;
    }
    my-pressure-outlet
    {
        type            patch;
        nFaces          73;
        startFace       101500;
    }
    my-wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          700;
        startFace       101573;
    }
    wedgeplanesBack
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          51100;
        startFace       102273;
    }
    wedgeplanesFront
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          51100;
        startFace       153373;
    }
    freeSurf
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          700;
        startFace       204473;
    }
)

// ************************************************************************* //
