TBL_Spalart/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform  276.;

boundaryField
{

    my-velocity-inlet
    {
        type            totalTemperature;
        gamma           1.4;
        T0              uniform 318.;
        value           uniform 318.;
    }

    my-pressure-outlet
    {
        type            zeroGradient;
    }

    my-wall
    {
        type            zeroGradient;
    }

    
    "(wedgeplanesFront|wedgeplanesBack)"
    {
        type            wedge;
    }

    
    freeSurf
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
