TBL_Spalart/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
type			sets;
interpolationScheme 	cellPointFace;


setFormat       	raw;

sets
(
   profile 
    {
        type   		uniform;
	axis		y;
	start           (-0.2 0.07618839437 0.0);
        end             (-0.2 0.812676207      0.0);
	//start		(-0.1  0.09525 0.0);
	//end		( 0.32 0.09525 0.0);
	nPoints		250;
        patches		("my-wall");
	interpolate 	false;
    }
);

fields          ( p rho T U thermo:mu);


// ************************************************************************* //
